In [2]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [3]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [4]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [5]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [13]:
df.loc[2:4]

    name  age       state  num_children  num_pets
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0

In [14]:
df.loc[:, ['name', 'age']]

    name  age
0   john   23
1   mary   78
2  peter   22
3   jeff   19
4   bill   45
5   lisa   33

In [18]:
df.loc[:,:]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [19]:
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [20]:
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [22]:
df.iloc[-1,]

name            lisa
age               33
state             dc
num_children       1
num_pets           0
Name: 5, dtype: object

In [27]:
df.iloc[0,3]

2

In [31]:
df.iloc[2:4,1:3]

   age       state
2   22  california
3   19       texas

In [32]:
df[df['age'] < 30]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
2  peter   22  california             0         0
3   jeff   19       texas             1         5

In [33]:
df[df['name'] == 'john']

   name  age state  num_children  num_pets
0  john   23  iowa             2         0

In [34]:
df[df.age> 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [38]:
df[df.name == 'john']

   name  age state  num_children  num_pets
0  john   23  iowa             2         0

In [39]:
df[df['num_pets'] > df['num_children']]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [40]:
df[df.num_pets> df.num_children]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [52]:
df[(df['num_pets'] >= 1) & (df['age'] > 40)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [51]:
df[(df.num_pets >= 1) & (df['age'] > 40)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [53]:
df[['name','state','num_pets']]

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [60]:
df[ (df['age'] > 40) | (df['num_pets'] >= 1)]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
3  jeff   19       texas             1         5
4  bill   45  washington             2         0

In [69]:
df.drop(['age', 'num_children'], axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [64]:
df.iloc[:,0:1]

    name
0   john
1   mary
2  peter
3   jeff
4   bill
5   lisa

In [75]:
silly = df.drop(['age'], axis=1)

In [71]:
silly

    name       state  num_children  num_pets
0   john        iowa             2         0
1   mary          dc             2         4
2  peter  california             0         0
3   jeff       texas             1         5
4   bill  washington             2         0
5   lisa          dc             1         0

In [85]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [86]:
df.age.describe()

count     6.000000
mean     36.666667
std      22.384518
min      19.000000
25%      22.250000
50%      28.000000
75%      42.000000
max      78.000000
Name: age, dtype: float64

In [91]:
df.num_pets.describe().mean

<bound method Series.mean of count    6.000000
mean     1.500000
std      2.345208
min      0.000000
25%      0.000000
50%      0.000000
75%      3.000000
max      5.000000
Name: num_pets, dtype: float64>

In [88]:
df[['age','num_pets','num_children']].mean(axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [93]:
import numpy as np
df[['age','num_pets','num_children']].apply(lambda col: np.mean(col),axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [94]:
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [95]:
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [97]:
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [100]:
type(df[['age']])

pandas.core.frame.DataFrame

In [101]:
type(df['age'])

pandas.core.series.Series

In [102]:
df.age * 2

0     46
1    156
2     44
3     38
4     90
5     66
Name: age, dtype: int64

In [103]:
df.age ** 2

0     529
1    6084
2     484
3     361
4    2025
5    1089
Name: age, dtype: int64

In [104]:
df[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [105]:
df[["age"]].apply(lambda value: value*value)

    age
0   529
1  6084
2   484
3   361
4  2025
5  1089

In [107]:
df[:]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [115]:
df.apply(lambda age: age*2)

         name  age                 state  num_children  num_pets
0    johnjohn   46              iowaiowa             4         0
1    marymary  156                  dcdc             4         8
2  peterpeter   44  californiacalifornia             0         0
3    jeffjeff   38            texastexas             2        10
4    billbill   90  washingtonwashington             4         0
5    lisalisa   66                  dcdc             2         0

In [132]:
df['age'] = df['age'].apply(lambda x: x/2)

In [134]:
df.sort_values("age",ascending=False)

    name   age       state  num_children  num_pets
1   mary  78.0          dc             2         4
4   bill  45.0  washington             2         0
5   lisa  33.0          dc             1         0
0   john  23.0        iowa             2         0
2  peter  22.0  california             0         0
3   jeff  19.0       texas             1         5

In [135]:
df[df.apply(lambda row: row['name'].startswith('j'),axis=1)]

   name   age  state  num_children  num_pets
0  john  23.0   iowa             2         0
3  jeff  19.0  texas             1         5

In [136]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType',['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD',  ['1$', '2$', '3$', '4$']),
    ('EU',   ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)

In [137]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [142]:
d.pivot(index='Item', columns='CType',values='USD')

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$